# Pandas Exercise Session 01

In [1]:
import pandas as pd

### Creating DataFrames and Series

In [2]:
pd.DataFrame({"Yes": [50, 21], "No": [131, 2]})

   Yes   No
0   50  131
1   21    2

In [3]:
pd.DataFrame(
    {"Bob": ["I liked it!", "It was awful."], "Susan": ["Pretty Good!", "Bland"]}
)

             Bob         Susan
0    I liked it!  Pretty Good!
1  It was awful.         Bland

In [ ]:
pd.DataFrame(
    {
        "Tom": ["It was alright.", "Didn't like it."],
        "Jane": ["Not bad.", "I liked this one."],
    },
    index=["Product A", "Product B"],
)

                       Tom               Jane
Product A  It was alright.           Not bad.
Product B  Didn't like it.  I liked this one.

In [5]:
pd.Series([num for num in range(10, 70, 10)])

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [8]:
s = pd.Series(
    [3e5, 6.5e3, 1e4],
    index=["2015 Sales", "2016 Sales", "2017 Sales"],
    name="Product A",
    dtype="i4",
)

s

2015 Sales    300000
2016 Sales      6500
2017 Sales     10000
Name: Product A, dtype: int32

In [9]:
s.name

'Product A'

### Reading a DataFrame from External Sources

In [10]:
dataset_path = r"./data/clean_jobs.csv"

df = pd.read_csv(dataset_path)

In [11]:
df.shape

(327, 10)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 327 entries, 0 to 326
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               327 non-null    int64
 1   title            327 non-null    object
 2   company          327 non-null    object
 3   location         327 non-null    object
 4   link             327 non-null    object
 5   source           327 non-null    object
 6   date_posted      327 non-null    object
 7   work_type        0 non-null      float64
 8   employment_type  0 non-null      float64
 9   description      327 non-null    object
dtypes: float64(2), int64(1), object(7)
memory usage: 25.7+ KB

In [14]:
df.head()

,id,title,company,location,link,source,date_posted,work_type,employment_type,description
0,1,Data Analyst,Meta,"New York, NY",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-14,NaN,NaN,The Social Measurement team is a growing team ...
1,2,Data Analyst,Meta,"San Francisco, CA",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-14,NaN,NaN,The Social Measurement team is a growing team ...
2,3,Data Analyst,Meta,"Los Angeles, CA",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-14,NaN,NaN,The Social Measurement team is a growing team ...
3,4,Data Analyst,Meta,"Washington, DC",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-14,NaN,NaN,The Social Measurement team is a growing team ...
4,5,Data Analyst II,Pinterest,"Chicago, IL",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-16,NaN,NaN,About Pinterest\n\nMillions of people around t...

In [33]:
df.tail(7)

,id,title,company,location,link,source,date_posted,work_type,employment_type,description
320,689,Data Analytics Engineer,Checkout.com,"London, England, United Kingdom",https://uk.linkedin.com/jobs/view/data-analyti...,LinkedIn,2025-04-14,NaN,NaN,Company Description\n\nCheckout.com is one of ...
321,690,Data Engineer (Platform),tiket.com,"Jakarta, Jakarta, Indonesia",https://id.linkedin.com/jobs/view/data-enginee...,LinkedIn,2025-04-11,NaN,NaN,We think you also hate when travel app is givi...
322,691,Data Engineer- Python Pyspark,Virtusa,"Chennai, Tamil Nadu, India",https://in.linkedin.com/jobs/view/data-enginee...,LinkedIn,2025-04-10,NaN,NaN,Senior Data Engineer\n\nPosition Summary\n\nTh...
323,692,Data Engineer with Pyspark,Cognizant,"Bangalore Urban, Karnataka, India",https://in.linkedin.com/jobs/view/data-enginee...,LinkedIn,2025-04-13,NaN,NaN,Job Title:- Data Engineer with Pyspark\n\nLoca...
324,693,Data Engineer,Mercedes-Benz Malaysia,"Puchong, Selangor, Malaysia",https://my.linkedin.com/jobs/view/data-enginee...,LinkedIn,2025-04-16,NaN,NaN,"About Us\n\n\n\n\nAt Mercedes-Benz, we don’t j..."
325,740,Data Engineer I,IntePros,"Seattle, WA",https://www.linkedin.com/jobs/view/data-engine...,LinkedIn,2025-04-15,NaN,NaN,Data Engineer I – Infrastructure & Automation ...
326,741,Data Engineer,Snap Inc.,"Bellevue, WA",https://www.linkedin.com/jobs/view/data-engine...,LinkedIn,2025-04-16,NaN,NaN,Snap Inc is a technology company. We believe t...

### Questions

In [19]:
# 1
fruits = pd.DataFrame({"Apples": 30, "Bananas": 21}, index=[0])
fruits

   Apples  Bananas
0      30       21

In [24]:
pd.DataFrame([[30, 21]], columns=["Apples", "Bananas"])

   Apples  Bananas
0      30       21

In [28]:
# 2
fruit_sales = pd.DataFrame(
    {"Apples": [35, 41], "Bananas": [21, 34]}, index=["2017 Sales", "2018 Sales"]
)

fruit_sales

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

In [ ]:
# 3
labels = ["Flour", "Milk", "Eggs", "Spam"]
ingredients = pd.Series(
    ["4 cups", "1 cup", "2 large", "1 can"], index=labels, name="Dinner"
)
ingredients

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

In [31]:
# 4
animals = pd.DataFrame(
    {"Cows": [12, 20], "Goats": [22, 19]}, index=["Year 1", "Year 2"]
)
animals

        Cows  Goats
Year 1    12     22
Year 2    20     19

In [32]:
animals.to_csv("./data/cows_and_goats.csv")